{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "alpha" : 0.33525252342224121,
      "bottom" : "input1",
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "input1__fix__underflow_____Conv1",
      "type" : "elementwise",
      "name" : "Conv1__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "bn_Conv1_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input1__fix__underflow_____Conv1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 5
      },
      "top" : "Conv1_relu_output",
      "type" : "activation",
      "name" : "Conv1_relu",
      "bottom" : "bn_Conv1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_depthwise_BN_output",
      "blob_weights" : 9,
      "K" : 16,
      "blob_biases" : 7,
      "name" : "expanded_conv_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Conv1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 11
      },
      "top" : "expanded_conv_depthwise_relu_output",
      "type" : "activation",
      "name" : "expanded_conv_depthwise_relu",
      "bottom" : "expanded_conv_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_project_BN_output",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "expanded_conv_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "expanded_conv_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_expand_BN_output",
      "blob_weights" : 19,
      "K" : 8,
      "blob_biases" : 17,
      "name" : "block_1_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "expanded_conv_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 21
      },
      "top" : "block_1_expand_relu_output",
      "type" : "activation",
      "name" : "block_1_expand_relu",
      "bottom" : "block_1_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_1_depthwise_BN_output",
      "blob_weights" : 25,
      "K" : 48,
      "blob_biases" : 23,
      "stride_x" : 2,
      "name" : "block_1_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 27
      },
      "top" : "block_1_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_1_depthwise_relu",
      "bottom" : "block_1_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_project_BN_output",
      "blob_weights" : 31,
      "K" : 48,
      "blob_biases" : 29,
      "name" : "block_1_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_1_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_expand_BN_output",
      "blob_weights" : 35,
      "K" : 8,
      "blob_biases" : 33,
      "name" : "block_2_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 37
      },
      "top" : "block_2_expand_relu_output",
      "type" : "activation",
      "name" : "block_2_expand_relu",
      "bottom" : "block_2_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_depthwise_BN_output",
      "blob_weights" : 41,
      "K" : 48,
      "blob_biases" : 39,
      "name" : "block_2_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 43
      },
      "top" : "block_2_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_2_depthwise_relu",
      "bottom" : "block_2_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_project_BN_output",
      "blob_weights" : 47,
      "K" : 48,
      "blob_biases" : 45,
      "name" : "block_2_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_2_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_1_project_BN_output,block_2_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_2_add_output",
      "type" : "elementwise",
      "name" : "block_2_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_expand_BN_output",
      "blob_weights" : 51,
      "K" : 8,
      "blob_biases" : 49,
      "name" : "block_3_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 53
      },
      "top" : "block_3_expand_relu_output",
      "type" : "activation",
      "name" : "block_3_expand_relu",
      "bottom" : "block_3_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_3_depthwise_BN_output",
      "blob_weights" : 57,
      "K" : 48,
      "blob_biases" : 55,
      "stride_x" : 2,
      "name" : "block_3_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_3_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 59
      },
      "top" : "block_3_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_3_depthwise_relu",
      "bottom" : "block_3_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_project_BN_output",
      "blob_weights" : 63,
      "K" : 48,
      "blob_biases" : 61,
      "name" : "block_3_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_3_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_4_expand_BN_output",
      "blob_weights" : 67,
      "K" : 16,
      "blob_biases" : 65,
      "name" : "Cont_block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_4_expand_BN_output",
      "blob_weights" : 71,
      "K" : 16,
      "blob_biases" : 69,
      "name" : "Lips_block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_4_expand_BN_output",
      "blob_weights" : 75,
      "K" : 16,
      "blob_biases" : 73,
      "name" : "RE_block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_4_expand_BN_output",
      "blob_weights" : 79,
      "K" : 16,
      "blob_biases" : 77,
      "name" : "LE_block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 81
      },
      "top" : "Cont_block_4_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_4_expand_relu",
      "bottom" : "Cont_block_4_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 83
      },
      "top" : "Lips_block_4_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_4_expand_relu",
      "bottom" : "Lips_block_4_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 85
      },
      "top" : "RE_block_4_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_4_expand_relu",
      "bottom" : "RE_block_4_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 87
      },
      "top" : "LE_block_4_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_4_expand_relu",
      "bottom" : "LE_block_4_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_4_depthwise_BN_output",
      "blob_weights" : 91,
      "K" : 96,
      "blob_biases" : 89,
      "name" : "Cont_block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "Cont_block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_4_depthwise_BN_output",
      "blob_weights" : 95,
      "K" : 96,
      "blob_biases" : 93,
      "name" : "Lips_block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "Lips_block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_4_depthwise_BN_output",
      "blob_weights" : 99,
      "K" : 96,
      "blob_biases" : 97,
      "name" : "RE_block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "RE_block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_4_depthwise_BN_output",
      "blob_weights" : 103,
      "K" : 96,
      "blob_biases" : 101,
      "name" : "LE_block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "LE_block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 105
      },
      "top" : "Cont_block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_4_depthwise_relu",
      "bottom" : "Cont_block_4_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 107
      },
      "top" : "Lips_block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_4_depthwise_relu",
      "bottom" : "Lips_block_4_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 109
      },
      "top" : "RE_block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_4_depthwise_relu",
      "bottom" : "RE_block_4_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 111
      },
      "top" : "LE_block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_4_depthwise_relu",
      "bottom" : "LE_block_4_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_4_project_BN_output",
      "blob_weights" : 115,
      "K" : 96,
      "blob_biases" : 113,
      "name" : "Cont_block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Cont_block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_4_project_BN_output",
      "blob_weights" : 119,
      "K" : 96,
      "blob_biases" : 117,
      "name" : "Lips_block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Lips_block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_4_project_BN_output",
      "blob_weights" : 123,
      "K" : 96,
      "blob_biases" : 121,
      "name" : "RE_block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "RE_block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_4_project_BN_output",
      "blob_weights" : 127,
      "K" : 96,
      "blob_biases" : 125,
      "name" : "LE_block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "LE_block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_5_expand_BN_output",
      "blob_weights" : 131,
      "K" : 8,
      "blob_biases" : 129,
      "name" : "Cont_block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_4_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_5_expand_BN_output",
      "blob_weights" : 135,
      "K" : 8,
      "blob_biases" : 133,
      "name" : "Lips_block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_4_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_5_expand_BN_output",
      "blob_weights" : 139,
      "K" : 8,
      "blob_biases" : 137,
      "name" : "RE_block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_4_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_5_expand_BN_output",
      "blob_weights" : 143,
      "K" : 8,
      "blob_biases" : 141,
      "name" : "LE_block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_4_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 145
      },
      "top" : "Cont_block_5_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_5_expand_relu",
      "bottom" : "Cont_block_5_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 147
      },
      "top" : "Lips_block_5_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_5_expand_relu",
      "bottom" : "Lips_block_5_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 149
      },
      "top" : "RE_block_5_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_5_expand_relu",
      "bottom" : "RE_block_5_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 151
      },
      "top" : "LE_block_5_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_5_expand_relu",
      "bottom" : "LE_block_5_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_5_depthwise_BN_output",
      "blob_weights" : 155,
      "K" : 48,
      "blob_biases" : 153,
      "name" : "Cont_block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_5_depthwise_BN_output",
      "blob_weights" : 159,
      "K" : 48,
      "blob_biases" : 157,
      "name" : "Lips_block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_5_depthwise_BN_output",
      "blob_weights" : 163,
      "K" : 48,
      "blob_biases" : 161,
      "name" : "RE_block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_5_depthwise_BN_output",
      "blob_weights" : 167,
      "K" : 48,
      "blob_biases" : 165,
      "name" : "LE_block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 169
      },
      "top" : "Cont_block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_5_depthwise_relu",
      "bottom" : "Cont_block_5_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 171
      },
      "top" : "Lips_block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_5_depthwise_relu",
      "bottom" : "Lips_block_5_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 173
      },
      "top" : "RE_block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_5_depthwise_relu",
      "bottom" : "RE_block_5_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 175
      },
      "top" : "LE_block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_5_depthwise_relu",
      "bottom" : "LE_block_5_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_5_project_BN_output",
      "blob_weights" : 179,
      "K" : 48,
      "blob_biases" : 177,
      "name" : "Cont_block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Cont_block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_5_project_BN_output",
      "blob_weights" : 183,
      "K" : 48,
      "blob_biases" : 181,
      "name" : "Lips_block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Lips_block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_5_project_BN_output",
      "blob_weights" : 187,
      "K" : 48,
      "blob_biases" : 185,
      "name" : "RE_block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "RE_block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_5_project_BN_output",
      "blob_weights" : 191,
      "K" : 48,
      "blob_biases" : 189,
      "name" : "LE_block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "LE_block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "Cont_block_4_project_BN_output,Cont_block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Cont_block_5_add_output",
      "type" : "elementwise",
      "name" : "Cont_block_5_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "Lips_block_4_project_BN_output,Lips_block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Lips_block_5_add_output",
      "type" : "elementwise",
      "name" : "Lips_block_5_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "RE_block_4_project_BN_output,RE_block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "RE_block_5_add_output",
      "type" : "elementwise",
      "name" : "RE_block_5_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "LE_block_4_project_BN_output,LE_block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "LE_block_5_add_output",
      "type" : "elementwise",
      "name" : "LE_block_5_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_6_expand_BN_output",
      "blob_weights" : 195,
      "K" : 8,
      "blob_biases" : 193,
      "name" : "Cont_block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_6_expand_BN_output",
      "blob_weights" : 199,
      "K" : 8,
      "blob_biases" : 197,
      "name" : "Lips_block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_6_expand_BN_output",
      "blob_weights" : 203,
      "K" : 8,
      "blob_biases" : 201,
      "name" : "RE_block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_6_expand_BN_output",
      "blob_weights" : 207,
      "K" : 8,
      "blob_biases" : 205,
      "name" : "LE_block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 209
      },
      "top" : "Cont_block_6_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_6_expand_relu",
      "bottom" : "Cont_block_6_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 211
      },
      "top" : "Lips_block_6_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_6_expand_relu",
      "bottom" : "Lips_block_6_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 213
      },
      "top" : "RE_block_6_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_6_expand_relu",
      "bottom" : "RE_block_6_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 215
      },
      "top" : "LE_block_6_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_6_expand_relu",
      "bottom" : "LE_block_6_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "Cont_block_6_depthwise_BN_output",
      "blob_weights" : 219,
      "K" : 48,
      "blob_biases" : 217,
      "stride_x" : 2,
      "name" : "Cont_block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "Lips_block_6_depthwise_BN_output",
      "blob_weights" : 223,
      "K" : 48,
      "blob_biases" : 221,
      "stride_x" : 2,
      "name" : "Lips_block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "RE_block_6_depthwise_BN_output",
      "blob_weights" : 227,
      "K" : 48,
      "blob_biases" : 225,
      "stride_x" : 2,
      "name" : "RE_block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "LE_block_6_depthwise_BN_output",
      "blob_weights" : 231,
      "K" : 48,
      "blob_biases" : 229,
      "stride_x" : 2,
      "name" : "LE_block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 233
      },
      "top" : "Cont_block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_6_depthwise_relu",
      "bottom" : "Cont_block_6_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 235
      },
      "top" : "Lips_block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_6_depthwise_relu",
      "bottom" : "Lips_block_6_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 237
      },
      "top" : "RE_block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_6_depthwise_relu",
      "bottom" : "RE_block_6_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 239
      },
      "top" : "LE_block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_6_depthwise_relu",
      "bottom" : "LE_block_6_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_6_project_BN_output",
      "blob_weights" : 243,
      "K" : 48,
      "blob_biases" : 241,
      "name" : "Cont_block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Cont_block_6_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_6_project_BN_output",
      "blob_weights" : 247,
      "K" : 48,
      "blob_biases" : 245,
      "name" : "Lips_block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Lips_block_6_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_6_project_BN_output",
      "blob_weights" : 251,
      "K" : 48,
      "blob_biases" : 249,
      "name" : "RE_block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "RE_block_6_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_6_project_BN_output",
      "blob_weights" : 255,
      "K" : 48,
      "blob_biases" : 253,
      "name" : "LE_block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "LE_block_6_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_7_expand_BN_output",
      "blob_weights" : 259,
      "K" : 8,
      "blob_biases" : 257,
      "name" : "Cont_block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_6_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_7_expand_BN_output",
      "blob_weights" : 263,
      "K" : 8,
      "blob_biases" : 261,
      "name" : "Lips_block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_6_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_7_expand_BN_output",
      "blob_weights" : 267,
      "K" : 8,
      "blob_biases" : 265,
      "name" : "RE_block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_6_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_7_expand_BN_output",
      "blob_weights" : 271,
      "K" : 8,
      "blob_biases" : 269,
      "name" : "LE_block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_6_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 273
      },
      "top" : "Cont_block_7_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_7_expand_relu",
      "bottom" : "Cont_block_7_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 275
      },
      "top" : "Lips_block_7_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_7_expand_relu",
      "bottom" : "Lips_block_7_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 277
      },
      "top" : "RE_block_7_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_7_expand_relu",
      "bottom" : "RE_block_7_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 279
      },
      "top" : "LE_block_7_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_7_expand_relu",
      "bottom" : "LE_block_7_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_7_depthwise_BN_output",
      "blob_weights" : 283,
      "K" : 48,
      "blob_biases" : 281,
      "name" : "Cont_block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Cont_block_7_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_7_depthwise_BN_output",
      "blob_weights" : 287,
      "K" : 48,
      "blob_biases" : 285,
      "name" : "Lips_block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Lips_block_7_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_7_depthwise_BN_output",
      "blob_weights" : 291,
      "K" : 48,
      "blob_biases" : 289,
      "name" : "RE_block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "RE_block_7_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_7_depthwise_BN_output",
      "blob_weights" : 295,
      "K" : 48,
      "blob_biases" : 293,
      "name" : "LE_block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "LE_block_7_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 297
      },
      "top" : "Cont_block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_7_depthwise_relu",
      "bottom" : "Cont_block_7_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 299
      },
      "top" : "Lips_block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_7_depthwise_relu",
      "bottom" : "Lips_block_7_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 301
      },
      "top" : "RE_block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_7_depthwise_relu",
      "bottom" : "RE_block_7_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 303
      },
      "top" : "LE_block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_7_depthwise_relu",
      "bottom" : "LE_block_7_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_7_project_BN_output",
      "blob_weights" : 307,
      "K" : 48,
      "blob_biases" : 305,
      "name" : "Cont_block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Cont_block_7_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_7_project_BN_output",
      "blob_weights" : 311,
      "K" : 48,
      "blob_biases" : 309,
      "name" : "Lips_block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Lips_block_7_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_7_project_BN_output",
      "blob_weights" : 315,
      "K" : 48,
      "blob_biases" : 313,
      "name" : "RE_block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "RE_block_7_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_7_project_BN_output",
      "blob_weights" : 319,
      "K" : 48,
      "blob_biases" : 317,
      "name" : "LE_block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "LE_block_7_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "Cont_block_6_project_BN_output,Cont_block_7_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Cont_block_7_add_output",
      "type" : "elementwise",
      "name" : "Cont_block_7_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
