{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "alpha" : 0.4618661105632782,
      "bottom" : "input1",
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "input1__fix__underflow_____Conv1",
      "type" : "elementwise",
      "name" : "Conv1__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "bn_Conv1_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input1__fix__underflow_____Conv1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 5
      },
      "top" : "Conv1_relu_output",
      "type" : "activation",
      "name" : "Conv1_relu",
      "bottom" : "bn_Conv1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_depthwise_BN_output",
      "blob_weights" : 9,
      "K" : 16,
      "blob_biases" : 7,
      "name" : "expanded_conv_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Conv1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 11
      },
      "top" : "expanded_conv_depthwise_relu_output",
      "type" : "activation",
      "name" : "expanded_conv_depthwise_relu",
      "bottom" : "expanded_conv_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_project_BN_output",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "expanded_conv_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "expanded_conv_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_expand_BN_output",
      "blob_weights" : 19,
      "K" : 8,
      "blob_biases" : 17,
      "name" : "block_1_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "expanded_conv_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 21
      },
      "top" : "block_1_expand_relu_output",
      "type" : "activation",
      "name" : "block_1_expand_relu",
      "bottom" : "block_1_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_1_depthwise_BN_output",
      "blob_weights" : 25,
      "K" : 48,
      "blob_biases" : 23,
      "stride_x" : 2,
      "name" : "block_1_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 27
      },
      "top" : "block_1_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_1_depthwise_relu",
      "bottom" : "block_1_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_project_BN_output",
      "blob_weights" : 31,
      "K" : 48,
      "blob_biases" : 29,
      "name" : "block_1_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_1_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_expand_BN_output",
      "blob_weights" : 35,
      "K" : 8,
      "blob_biases" : 33,
      "name" : "block_2_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_1_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 37
      },
      "top" : "block_2_expand_relu_output",
      "type" : "activation",
      "name" : "block_2_expand_relu",
      "bottom" : "block_2_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_depthwise_BN_output",
      "blob_weights" : 41,
      "K" : 48,
      "blob_biases" : 39,
      "name" : "block_2_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 43
      },
      "top" : "block_2_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_2_depthwise_relu",
      "bottom" : "block_2_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_project_BN_output",
      "blob_weights" : 47,
      "K" : 48,
      "blob_biases" : 45,
      "name" : "block_2_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "block_2_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_1_project_BN_output,block_2_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_2_add_output",
      "type" : "elementwise",
      "name" : "block_2_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_expand_BN_output",
      "blob_weights" : 51,
      "K" : 8,
      "blob_biases" : 49,
      "name" : "block_3_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_2_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 53
      },
      "top" : "block_3_expand_relu_output",
      "type" : "activation",
      "name" : "block_3_expand_relu",
      "bottom" : "block_3_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_3_depthwise_BN_output",
      "blob_weights" : 57,
      "K" : 48,
      "blob_biases" : 55,
      "stride_x" : 2,
      "name" : "block_3_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 48,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "block_3_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 59
      },
      "top" : "block_3_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_3_depthwise_relu",
      "bottom" : "block_3_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_project_BN_output",
      "blob_weights" : 63,
      "K" : 48,
      "blob_biases" : 61,
      "name" : "block_3_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_3_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_expand_BN_output",
      "blob_weights" : 67,
      "K" : 16,
      "blob_biases" : 65,
      "name" : "block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 69
      },
      "top" : "block_4_expand_relu_output",
      "type" : "activation",
      "name" : "block_4_expand_relu",
      "bottom" : "block_4_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_depthwise_BN_output",
      "blob_weights" : 73,
      "K" : 96,
      "blob_biases" : 71,
      "name" : "block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 75
      },
      "top" : "block_4_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_4_depthwise_relu",
      "bottom" : "block_4_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_project_BN_output",
      "blob_weights" : 79,
      "K" : 96,
      "blob_biases" : 77,
      "name" : "block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_3_project_BN_output,block_4_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_4_add_output",
      "type" : "elementwise",
      "name" : "block_4_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_expand_BN_output",
      "blob_weights" : 83,
      "K" : 16,
      "blob_biases" : 81,
      "name" : "block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_4_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 85
      },
      "top" : "block_5_expand_relu_output",
      "type" : "activation",
      "name" : "block_5_expand_relu",
      "bottom" : "block_5_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_depthwise_BN_output",
      "blob_weights" : 89,
      "K" : 96,
      "blob_biases" : 87,
      "name" : "block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 91
      },
      "top" : "block_5_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_5_depthwise_relu",
      "bottom" : "block_5_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_project_BN_output",
      "blob_weights" : 95,
      "K" : 96,
      "blob_biases" : 93,
      "name" : "block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_4_add_output,block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_5_add_output",
      "type" : "elementwise",
      "name" : "block_5_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_6_expand_BN_output",
      "blob_weights" : 99,
      "K" : 16,
      "blob_biases" : 97,
      "name" : "block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 101
      },
      "top" : "block_6_expand_relu_output",
      "type" : "activation",
      "name" : "block_6_expand_relu",
      "bottom" : "block_6_expand_BN_output"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 0,
      "top" : "block_6_depthwise_BN_output",
      "blob_weights" : 105,
      "K" : 96,
      "blob_biases" : 103,
      "stride_x" : 2,
      "name" : "block_6_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_6_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 107
      },
      "top" : "block_6_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_6_depthwise_relu",
      "bottom" : "block_6_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_6_project_BN_output",
      "blob_weights" : 111,
      "K" : 96,
      "blob_biases" : 109,
      "name" : "block_6_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_6_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_expand_BN_output",
      "blob_weights" : 115,
      "K" : 24,
      "blob_biases" : 113,
      "name" : "block_7_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_6_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 117
      },
      "top" : "block_7_expand_relu_output",
      "type" : "activation",
      "name" : "block_7_expand_relu",
      "bottom" : "block_7_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_depthwise_BN_output",
      "blob_weights" : 121,
      "K" : 144,
      "blob_biases" : 119,
      "name" : "block_7_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_7_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 123
      },
      "top" : "block_7_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_7_depthwise_relu",
      "bottom" : "block_7_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_7_project_BN_output",
      "blob_weights" : 127,
      "K" : 144,
      "blob_biases" : 125,
      "name" : "block_7_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_7_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_6_project_BN_output,block_7_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_7_add_output",
      "type" : "elementwise",
      "name" : "block_7_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_expand_BN_output",
      "blob_weights" : 131,
      "K" : 24,
      "blob_biases" : 129,
      "name" : "block_8_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_7_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 133
      },
      "top" : "block_8_expand_relu_output",
      "type" : "activation",
      "name" : "block_8_expand_relu",
      "bottom" : "block_8_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_depthwise_BN_output",
      "blob_weights" : 137,
      "K" : 144,
      "blob_biases" : 135,
      "name" : "block_8_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_8_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 139
      },
      "top" : "block_8_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_8_depthwise_relu",
      "bottom" : "block_8_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_8_project_BN_output",
      "blob_weights" : 143,
      "K" : 144,
      "blob_biases" : 141,
      "name" : "block_8_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_8_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_7_add_output,block_8_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_8_add_output",
      "type" : "elementwise",
      "name" : "block_8_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_expand_BN_output",
      "blob_weights" : 147,
      "K" : 24,
      "blob_biases" : 145,
      "name" : "block_9_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_8_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 149
      },
      "top" : "block_9_expand_relu_output",
      "type" : "activation",
      "name" : "block_9_expand_relu",
      "bottom" : "block_9_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_depthwise_BN_output",
      "blob_weights" : 153,
      "K" : 144,
      "blob_biases" : 151,
      "name" : "block_9_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 155
      },
      "top" : "block_9_depthwise_relu_output",
      "type" : "activation",
      "name" : "block_9_depthwise_relu",
      "bottom" : "block_9_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_9_project_BN_output",
      "blob_weights" : 159,
      "K" : 144,
      "blob_biases" : 157,
      "name" : "block_9_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_9_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_8_add_output,block_9_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_9_add_output",
      "type" : "elementwise",
      "name" : "block_9_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_10_expand_BN_output",
      "blob_weights" : 163,
      "K" : 24,
      "blob_biases" : 161,
      "name" : "Cont_block_10_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_10_expand_BN_output",
      "blob_weights" : 167,
      "K" : 24,
      "blob_biases" : 165,
      "name" : "Lips_block_10_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_10_expand_BN_output",
      "blob_weights" : 171,
      "K" : 24,
      "blob_biases" : 169,
      "name" : "RE_block_10_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_10_expand_BN_output",
      "blob_weights" : 175,
      "K" : 24,
      "blob_biases" : 173,
      "name" : "LE_block_10_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_9_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 177
      },
      "top" : "Cont_block_10_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_10_expand_relu",
      "bottom" : "Cont_block_10_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 179
      },
      "top" : "Lips_block_10_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_10_expand_relu",
      "bottom" : "Lips_block_10_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 181
      },
      "top" : "RE_block_10_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_10_expand_relu",
      "bottom" : "RE_block_10_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 183
      },
      "top" : "LE_block_10_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_10_expand_relu",
      "bottom" : "LE_block_10_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_10_depthwise_BN_output",
      "blob_weights" : 187,
      "K" : 144,
      "blob_biases" : 185,
      "name" : "Cont_block_10_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "Cont_block_10_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_10_depthwise_BN_output",
      "blob_weights" : 191,
      "K" : 144,
      "blob_biases" : 189,
      "name" : "Lips_block_10_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "Lips_block_10_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_10_depthwise_BN_output",
      "blob_weights" : 195,
      "K" : 144,
      "blob_biases" : 193,
      "name" : "RE_block_10_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "RE_block_10_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_10_depthwise_BN_output",
      "blob_weights" : 199,
      "K" : 144,
      "blob_biases" : 197,
      "name" : "LE_block_10_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "LE_block_10_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 201
      },
      "top" : "Cont_block_10_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_10_depthwise_relu",
      "bottom" : "Cont_block_10_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 203
      },
      "top" : "Lips_block_10_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_10_depthwise_relu",
      "bottom" : "Lips_block_10_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 205
      },
      "top" : "RE_block_10_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_10_depthwise_relu",
      "bottom" : "RE_block_10_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 207
      },
      "top" : "LE_block_10_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_10_depthwise_relu",
      "bottom" : "LE_block_10_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_10_project_BN_output",
      "blob_weights" : 211,
      "K" : 144,
      "blob_biases" : 209,
      "name" : "Cont_block_10_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "Cont_block_10_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_10_project_BN_output",
      "blob_weights" : 215,
      "K" : 144,
      "blob_biases" : 213,
      "name" : "Lips_block_10_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "Lips_block_10_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_10_project_BN_output",
      "blob_weights" : 219,
      "K" : 144,
      "blob_biases" : 217,
      "name" : "RE_block_10_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "RE_block_10_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_10_project_BN_output",
      "blob_weights" : 223,
      "K" : 144,
      "blob_biases" : 221,
      "name" : "LE_block_10_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "LE_block_10_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_11_expand_BN_output",
      "blob_weights" : 227,
      "K" : 12,
      "blob_biases" : 225,
      "name" : "Cont_block_11_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Cont_block_10_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_11_expand_BN_output",
      "blob_weights" : 231,
      "K" : 12,
      "blob_biases" : 229,
      "name" : "Lips_block_11_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Lips_block_10_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_11_expand_BN_output",
      "blob_weights" : 235,
      "K" : 12,
      "blob_biases" : 233,
      "name" : "RE_block_11_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "RE_block_10_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_11_expand_BN_output",
      "blob_weights" : 239,
      "K" : 12,
      "blob_biases" : 237,
      "name" : "LE_block_11_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "LE_block_10_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 241
      },
      "top" : "Cont_block_11_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_11_expand_relu",
      "bottom" : "Cont_block_11_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 243
      },
      "top" : "Lips_block_11_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_11_expand_relu",
      "bottom" : "Lips_block_11_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 245
      },
      "top" : "RE_block_11_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_11_expand_relu",
      "bottom" : "RE_block_11_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 247
      },
      "top" : "LE_block_11_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_11_expand_relu",
      "bottom" : "LE_block_11_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_11_depthwise_BN_output",
      "blob_weights" : 251,
      "K" : 72,
      "blob_biases" : 249,
      "name" : "Cont_block_11_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Cont_block_11_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_11_depthwise_BN_output",
      "blob_weights" : 255,
      "K" : 72,
      "blob_biases" : 253,
      "name" : "Lips_block_11_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Lips_block_11_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_11_depthwise_BN_output",
      "blob_weights" : 259,
      "K" : 72,
      "blob_biases" : 257,
      "name" : "RE_block_11_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "RE_block_11_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_11_depthwise_BN_output",
      "blob_weights" : 263,
      "K" : 72,
      "blob_biases" : 261,
      "name" : "LE_block_11_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "LE_block_11_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 265
      },
      "top" : "Cont_block_11_depthwise_relu_output",
      "type" : "activation",
      "name" : "Cont_block_11_depthwise_relu",
      "bottom" : "Cont_block_11_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 267
      },
      "top" : "Lips_block_11_depthwise_relu_output",
      "type" : "activation",
      "name" : "Lips_block_11_depthwise_relu",
      "bottom" : "Lips_block_11_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 269
      },
      "top" : "RE_block_11_depthwise_relu_output",
      "type" : "activation",
      "name" : "RE_block_11_depthwise_relu",
      "bottom" : "RE_block_11_depthwise_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 271
      },
      "top" : "LE_block_11_depthwise_relu_output",
      "type" : "activation",
      "name" : "LE_block_11_depthwise_relu",
      "bottom" : "LE_block_11_depthwise_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_11_project_BN_output",
      "blob_weights" : 275,
      "K" : 72,
      "blob_biases" : 273,
      "name" : "Cont_block_11_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "Cont_block_11_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_11_project_BN_output",
      "blob_weights" : 279,
      "K" : 72,
      "blob_biases" : 277,
      "name" : "Lips_block_11_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "Lips_block_11_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_11_project_BN_output",
      "blob_weights" : 283,
      "K" : 72,
      "blob_biases" : 281,
      "name" : "RE_block_11_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "RE_block_11_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_11_project_BN_output",
      "blob_weights" : 287,
      "K" : 72,
      "blob_biases" : 285,
      "name" : "LE_block_11_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "LE_block_11_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "Cont_block_10_project_BN_output,Cont_block_11_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Cont_block_11_add_output",
      "type" : "elementwise",
      "name" : "Cont_block_11_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "Lips_block_10_project_BN_output,Lips_block_11_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "Lips_block_11_add_output",
      "type" : "elementwise",
      "name" : "Lips_block_11_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "RE_block_10_project_BN_output,RE_block_11_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "RE_block_11_add_output",
      "type" : "elementwise",
      "name" : "RE_block_11_add",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "LE_block_10_project_BN_output,LE_block_11_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "LE_block_11_add_output",
      "type" : "elementwise",
      "name" : "LE_block_11_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_12_expand_BN_output",
      "blob_weights" : 291,
      "K" : 12,
      "blob_biases" : 289,
      "name" : "Cont_block_12_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Cont_block_11_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Lips_block_12_expand_BN_output",
      "blob_weights" : 295,
      "K" : 12,
      "blob_biases" : 293,
      "name" : "Lips_block_12_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Lips_block_11_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "RE_block_12_expand_BN_output",
      "blob_weights" : 299,
      "K" : 12,
      "blob_biases" : 297,
      "name" : "RE_block_12_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "RE_block_11_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "LE_block_12_expand_BN_output",
      "blob_weights" : 303,
      "K" : 12,
      "blob_biases" : 301,
      "name" : "LE_block_12_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "LE_block_11_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 305
      },
      "top" : "Cont_block_12_expand_relu_output",
      "type" : "activation",
      "name" : "Cont_block_12_expand_relu",
      "bottom" : "Cont_block_12_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 307
      },
      "top" : "Lips_block_12_expand_relu_output",
      "type" : "activation",
      "name" : "Lips_block_12_expand_relu",
      "bottom" : "Lips_block_12_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 309
      },
      "top" : "RE_block_12_expand_relu_output",
      "type" : "activation",
      "name" : "RE_block_12_expand_relu",
      "bottom" : "RE_block_12_expand_BN_output"
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 311
      },
      "top" : "LE_block_12_expand_relu_output",
      "type" : "activation",
      "name" : "LE_block_12_expand_relu",
      "bottom" : "LE_block_12_expand_BN_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Cont_block_12_depthwise_BN_output",
      "blob_weights" : 315,
      "K" : 72,
      "blob_biases" : 313,
      "name" : "Cont_block_12_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "Cont_block_12_expand_relu_output",
