{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_0_0_output",
      "K" : 4,
      "blob_biases" : 1,
      "name" : "Iris__encoder_conv_0_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input1",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "Iris__encoder_relu_0_0_output",
      "pad_l" : 0,
      "name" : "Iris__pool_0",
      "top" : "Iris__pool_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_1_0_output",
      "K" : 8,
      "blob_biases" : 5,
      "name" : "Iris__encoder_conv_1_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Iris__pool_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "Iris__encoder_relu_1_0_output",
      "pad_l" : 0,
      "name" : "Iris__pool_1",
      "top" : "Iris__pool_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_2_0_output",
      "K" : 16,
      "blob_biases" : 9,
      "name" : "Iris__encoder_conv_2_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Iris__pool_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_2_1_output",
      "K" : 24,
      "blob_biases" : 13,
      "name" : "Iris__encoder_conv_2_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Iris__encoder_relu_2_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "Iris__encoder_relu_2_1_output",
      "pad_l" : 0,
      "name" : "Iris__pool_2",
      "top" : "Iris__pool_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_3_0_output",
      "K" : 24,
      "blob_biases" : 17,
      "name" : "Iris__encoder_conv_3_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Iris__pool_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_3_1_output",
      "K" : 32,
      "blob_biases" : 21,
      "name" : "Iris__encoder_conv_3_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Iris__encoder_relu_3_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "Iris__encoder_relu_3_1_output",
      "pad_l" : 0,
      "name" : "Iris__pool_3",
      "top" : "Iris__pool_3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_4_0_output",
      "K" : 32,
      "blob_biases" : 25,
      "name" : "Iris__encoder_conv_4_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Iris__pool_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__encoder_relu_4_1_output",
      "K" : 48,
      "blob_biases" : 29,
      "name" : "Iris__encoder_conv_4_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Iris__encoder_relu_4_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "Iris__encoder_relu_4_1_output",
      "pad_l" : 0,
      "name" : "Iris__pool_4",
      "top" : "Iris__pool_4_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__mid_relu_0_output",
      "K" : 48,
      "blob_biases" : 33,
      "name" : "Iris__mid_conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Iris__pool_4_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 4,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__mid_relu_1_output",
      "K" : 128,
      "blob_biases" : 37,
      "name" : "Iris__mid_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Iris__mid_relu_0_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "Iris__mid_relu_1_output",
      "scaling_factor_y" : 4,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__mid_upsampling_1_output",
      "scaling_factor_x" : 4,
      "type" : "upsample",
      "name" : "Iris__mid_upsampling_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_4_0_output",
      "K" : 128,
      "blob_biases" : 41,
      "name" : "Iris__decoder_conv_4_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Iris__mid_upsampling_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_4_1_output",
      "K" : 48,
      "blob_biases" : 45,
      "name" : "Iris__decoder_conv_4_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "Iris__decoder_relu_4_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "weights" : {

      },
      "top" : "Iris__concatenate_4_output",
      "type" : "concat",
      "name" : "Iris__concatenate_4",
      "bottom" : "Iris__decoder_relu_4_1_output,Iris__pool_4_output"
    },
    {
      "bottom" : "Iris__concatenate_4_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__upsampling_4_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "Iris__upsampling_4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_3_0_output",
      "K" : 96,
      "blob_biases" : 49,
      "name" : "Iris__decoder_conv_3_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Iris__upsampling_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_3_1_output",
      "K" : 32,
      "blob_biases" : 53,
      "name" : "Iris__decoder_conv_3_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Iris__decoder_relu_3_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "weights" : {

      },
      "top" : "Iris__concatenate_3_output",
      "type" : "concat",
      "name" : "Iris__concatenate_3",
      "bottom" : "Iris__decoder_relu_3_1_output,Iris__encoder_relu_4_1_output"
    },
    {
      "bottom" : "Iris__concatenate_3_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__upsampling_3_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "Iris__upsampling_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_2_0_output",
      "K" : 80,
      "blob_biases" : 57,
      "name" : "Iris__decoder_conv_2_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Iris__upsampling_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_2_1_output",
      "K" : 24,
      "blob_biases" : 61,
      "name" : "Iris__decoder_conv_2_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "Iris__decoder_relu_2_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "weights" : {

      },
      "top" : "Iris__concatenate_2_output",
      "type" : "concat",
      "name" : "Iris__concatenate_2",
      "bottom" : "Iris__decoder_relu_2_1_output,Iris__encoder_relu_3_1_output"
    },
    {
      "bottom" : "Iris__concatenate_2_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__upsampling_2_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "Iris__upsampling_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_1_0_output",
      "K" : 56,
      "blob_biases" : 65,
      "name" : "Iris__decoder_conv_1_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Iris__upsampling_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "weights" : {

      },
      "top" : "Iris__concatenate_1_output",
      "type" : "concat",
      "name" : "Iris__concatenate_1",
      "bottom" : "Iris__decoder_relu_1_0_output,Iris__encoder_relu_2_1_output"
    },
    {
      "bottom" : "Iris__concatenate_1_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__upsampling_1_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "Iris__upsampling_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__decoder_relu_0_0_output",
      "K" : 40,
      "blob_biases" : 69,
      "name" : "Iris__decoder_conv_0_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Iris__upsampling_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "weights" : {

      },
      "top" : "Iris__concatenate_0_output",
      "type" : "concat",
      "name" : "Iris__concatenate_0",
      "bottom" : "Iris__decoder_relu_0_0_output,Iris__encoder_relu_1_0_output"
    },
    {
      "bottom" : "Iris__concatenate_0_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "Iris__upsampling_0_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "Iris__upsampling_0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__last_relu_0_output",
      "K" : 24,
      "blob_biases" : 73,
      "name" : "Iris__last_conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "Iris__upsampling_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "weights" : {

      },
      "top" : "Iris__last_concatenate_0_output",
      "type" : "concat",
      "name" : "Iris__last_concatenate_0",
      "bottom" : "Iris__last_relu_0_output,Iris__encoder_relu_0_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Iris__out_convolution_output",
      "K" : 12,
      "blob_biases" : 77,
      "name" : "Iris__out_convolution",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "Iris__last_concatenate_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output1",
      "type" : "softmax",
      "name" : "Iris__output",
      "bottom" : "Iris__out_convolution_output"
    }
  ]
}